cases/square2D_multiprocessing/env02/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "30";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
23125
(
0.15958193
0.16195246
0.16586141
0.1706433
0.1757847
0.18090913
0.18576055
0.19018382
...
)
;

boundaryField
{
    IN
    {
        type            zeroGradient;
    }
    OUT
    {
        type            fixedValue;
        value           uniform 0;
    }
    SYM
    {
        type            symmetry;
    }
    RECT
    {
        type            zeroGradient;
    }
    JET3
    {
        type            zeroGradient;
    }
    JET8
    {
        type            zeroGradient;
    }
    JET1
    {
        type            zeroGradient;
    }
    JET2
    {
        type            zeroGradient;
    }
    JET4
    {
        type            zeroGradient;
    }
    JET5
    {
        type            zeroGradient;
    }
    JET6
    {
        type            zeroGradient;
    }
    JET7
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
